Revit 2027 API
RoundingMethod Enumeration
 Rounding methods
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RoundingMethod
Public Enumeration RoundingMethod
public enum class RoundingMethod
type RoundingMethod
Members
Member name | Value | Description
Down | 2 |  Round Down
Nearest | 0 |  Standard rounding: Round to Nearest
Up | 1 |  Round Up
See Also
Reference
Autodesk.Revit.DB Namespace